---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCAnyHandle
source: html/8b893943-70fa-94bf-90be-1523d516ecb3.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle

A handle representing an item in an IFC file.

## Syntax (C#)
```csharp
public class IFCAnyHandle : IDisposable
```

## Remarks
Handles are used to populate each line item in an IFC file. Each handle is assigned a unique identifier
 (an integer) which can be seen in the file contents at the start of the line.